//
//  Problem4344.swift
//  CodingTestPractice
//
//  Created by 김광록 on 7/13/25.
//

import Foundation

/**
 ## 문제 링크
 https://www.acmicpc.net/problem/4344

 ## 문제
 대학생 새내기들의 90%는 자신이 반에서 평균은 넘는다고 생각한다.
 당신은 그들에게 슬픈 진실을 알려줘야 한다.
 각 테스트 케이스마다 평균을 넘는 학생들의 비율을 출력하는 프로그램을 작성하시오.

 ## 입력
 첫째 줄에 테스트 케이스의 개수 C가 주어진다.
 둘째 줄부터 각 테스트 케이스마다 학생의 수 N과 N명의 점수가 주어진다.
 점수는 0보다 크거나 같고, 100보다 작거나 같은 정수이다.

 ## 출력
 각 케이스마다 평균을 넘는 학생들의 비율을 소수점 셋째 자리까지 반올림하여 출력한다.
 정답은 문자열로 백분율(%)을 함께 출력한다.

 ## 입력 예시
 5
 5 50 50 70 80 100
 7 100 95 90 80 70 60 50
 3 70 90 80
 3 70 90 81
 9 100 99 98 97 96 95 94 93 91

 ## 출력 예시
 40.000%
 57.143%
 33.333%
 66.667%
 55.556%
 */
func solveProblem4344() {
    // TODO: 문제 풀이를 여기에 작성하세요.
}
